all: 
	g++ -c main.cpp -o main.o
	g++ main.o -o main.out -pthread
	#@echo  "\e[1;31m ПРИМЕР РАБОТЫ ПРОГРАММЫ ПРИ СЧИТЫВАНИИ МАТРИЦЫ РАЗМЕРА 4х4 ИЗ ФАЙЛА С ВЫВОДОМ ПЕРВЫХ 4 СТРОК\e[0m"
	#./main.out 4 4 0 input.txt
	#@echo  "\e[1;31m ПРИМЕР РАБОТЫ ПРОГРАММЫ ПРИ СЧИТЫВАНИИ МАТРИЦЫ РАЗМЕРА 4х4 ПО ПЕРВОЙ ФОРМУЛЕ С ВЫВОДОМ ПЕРВЫХ 4 СТРОК\e[0m"
	#./main.out 4 4 1 input.txt
	#@echo  "\e[1;31m ПРИМЕР РАБОТЫ ПРОГРАММЫ ПРИ СЧИТЫВАНИИ МАТРИЦЫ РАЗМЕРА 4х4 ПО ВТОРОЙ ФОРМУЛЕ С ВЫВОДОМ ПЕРВЫХ 4 СТРОК\e[0m"
	#./main.out 4 4 2 input.txt
	#@echo  "\e[1;31m ПРИМЕР РАБОТЫ ПРОГРАММЫ ПРИ СЧИТЫВАНИИ МАТРИЦЫ РАЗМЕРА 4х4 ПО ТРЕТЬЕЙ ФОРМУЛЕ С ВЫВОДОМ ПЕРВЫХ 4 СТРОК\e[0m"
	#./main.out 4 4 3 input.txt
	#@echo  "\e[1;31m ПРИМЕР РАБОТЫ ПРОГРАММЫ ПРИ СЧИТЫВАНИИ МАТРИЦЫ РАЗМЕРА 4х4 ПО ЧЕТВЕРТОЙ ФОРМУЛЕ С ВЫВОДОМ ПЕРВЫХ 4 СТРОК\e[0m"
	#./main.out 4 4 4 input.txt
	@echo  "\e[1;31m ПРИМЕР РАБОТЫ ПРОГРАММЫ ПРИ СЧИТЫВАНИИ МАТРИЦЫ РАЗМЕРА 10х10 ПО ПЕРВОЙ ФОРМУЛЕ С ВЫВОДОМ ПЕРВЫХ 5 СТРОК\e[0m"
	./main.out 10 5 1 input.txt
	rm *.o *.out